CylinderRAS/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    sides
    {
        type            empty;
        //inGroups        1(empty);
        nFaces          131072;
        startFace       130816;
    }
    walls
    {
        type            wall;
        //inGroups        1(wall);
        nFaces          256;
        startFace       261888;
    }
    atmosphere
    {
        type            patch;
        nFaces          256;
        startFace       262144;
    }
)

// ************************************************************************* //
