CylinderRAS/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       sutherland; //const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles 		1;
	molWeight       8314.4621;
    }
    thermodynamics
    {
        Cp              3.5; //1004.5;
        Cv		2.5;
	Hf              0; //2.544e+06; 
    }
    transport
    {
	//mu              1.832e-7; // but it is not needed if use sutherland    
        As              1.67e-7; //mu*(1+Ts)
        Ts              0.412; // which is given by Ts/Tref=120/291.15
        Pr              0.72;
    }

}


// ************************************************************************* //
