CylinderRAS/system/pressure
pressure
{
type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;
writeFields     true;

surfaceFormat   raw;
regionType      patch;
name            walls;

operation       none;

fields
(
    p
);
}
